Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/isi.h
/* -------- ISI_SR : (ISI Offset: 0x28) ( R/ 32) ISI Status Register -------- */
#define ISI_SR_ENABLE_Pos                     _UINT32_(0)                                          /* (ISI_SR) Module Enable Position */
#define ISI_SR_ENABLE_Msk                     (_UINT32_(0x1) << ISI_SR_ENABLE_Pos)                 /* (ISI_SR) Module Enable Mask */
#define ISI_SR_ENABLE(value)                  (ISI_SR_ENABLE_Msk & (_UINT32_(value) << ISI_SR_ENABLE_Pos)) /* Assigment of value for ENABLE in the ISI_SR register */
#define ISI_SR_DIS_DONE_Pos                   _UINT32_(1)                                          /* (ISI_SR) Module Disable Request has Terminated (cleared on read) Position */
#define ISI_SR_DIS_DONE_Msk                   (_UINT32_(0x1) << ISI_SR_DIS_DONE_Pos)               /* (ISI_SR) Module Disable Request has Terminated (cleared on read) Mask */
#define ISI_SR_DIS_DONE(value)                (ISI_SR_DIS_DONE_Msk & (_UINT32_(value) << ISI_SR_DIS_DONE_Pos)) /* Assigment of value for DIS_DONE in the ISI_SR register */
#define ISI_SR_SRST_Pos                       _UINT32_(2)                                          /* (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Position */
#define ISI_SR_SRST_Msk                       (_UINT32_(0x1) << ISI_SR_SRST_Pos)                   /* (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Mask */
#define ISI_SR_SRST(value)                    (ISI_SR_SRST_Msk & (_UINT32_(value) << ISI_SR_SRST_Pos)) /* Assigment of value for SRST in the ISI_SR register */
#define ISI_SR_CDC_PND_Pos                    _UINT32_(8)                                          /* (ISI_SR) Pending Codec Request Position */
#define ISI_SR_CDC_PND_Msk                    (_UINT32_(0x1) << ISI_SR_CDC_PND_Pos)                /* (ISI_SR) Pending Codec Request Mask */
#define ISI_SR_CDC_PND(value)                 (ISI_SR_CDC_PND_Msk & (_UINT32_(value) << ISI_SR_CDC_PND_Pos)) /* Assigment of value for CDC_PND in the ISI_SR register */
#define ISI_SR_VSYNC_Pos                      _UINT32_(10)                                         /* (ISI_SR) Vertical Synchronization (cleared on read) Position */
#define ISI_SR_VSYNC_Msk                      (_UINT32_(0x1) << ISI_SR_VSYNC_Pos)                  /* (ISI_SR) Vertical Synchronization (cleared on read) Mask */
#define ISI_SR_VSYNC(value)                   (ISI_SR_VSYNC_Msk & (_UINT32_(value) << ISI_SR_VSYNC_Pos)) /* Assigment of value for VSYNC in the ISI_SR register */
#define ISI_SR_PXFR_DONE_Pos                  _UINT32_(16)                                         /* (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_PXFR_DONE_Msk                  (_UINT32_(0x1) << ISI_SR_PXFR_DONE_Pos)              /* (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_PXFR_DONE(value)               (ISI_SR_PXFR_DONE_Msk & (_UINT32_(value) << ISI_SR_PXFR_DONE_Pos)) /* Assigment of value for PXFR_DONE in the ISI_SR register */
#define ISI_SR_CXFR_DONE_Pos                  _UINT32_(17)                                         /* (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_CXFR_DONE_Msk                  (_UINT32_(0x1) << ISI_SR_CXFR_DONE_Pos)              /* (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_CXFR_DONE(value)               (ISI_SR_CXFR_DONE_Msk & (_UINT32_(value) << ISI_SR_CXFR_DONE_Pos)) /* Assigment of value for CXFR_DONE in the ISI_SR register */
#define ISI_SR_SIP_Pos                        _UINT32_(19)                                         /* (ISI_SR) Synchronization in Progress Position */
#define ISI_SR_SIP_Msk                        (_UINT32_(0x1) << ISI_SR_SIP_Pos)                    /* (ISI_SR) Synchronization in Progress Mask */
#define ISI_SR_SIP(value)                     (ISI_SR_SIP_Msk & (_UINT32_(value) << ISI_SR_SIP_Pos)) /* Assigment of value for SIP in the ISI_SR register */
#define ISI_SR_P_OVR_Pos                      _UINT32_(24)                                         /* (ISI_SR) Preview Datapath Overflow (cleared on read) Position */
#define ISI_SR_P_OVR_Msk                      (_UINT32_(0x1) << ISI_SR_P_OVR_Pos)                  /* (ISI_SR) Preview Datapath Overflow (cleared on read) Mask */
#define ISI_SR_P_OVR(value)                   (ISI_SR_P_OVR_Msk & (_UINT32_(value) << ISI_SR_P_OVR_Pos)) /* Assigment of value for P_OVR in the ISI_SR register */
#define ISI_SR_C_OVR_Pos                      _UINT32_(25)                                         /* (ISI_SR) Codec Datapath Overflow (cleared on read) Position */
#define ISI_SR_C_OVR_Msk                      (_UINT32_(0x1) << ISI_SR_C_OVR_Pos)                  /* (ISI_SR) Codec Datapath Overflow (cleared on read) Mask */
#define ISI_SR_C_OVR(value)                   (ISI_SR_C_OVR_Msk & (_UINT32_(value) << ISI_SR_C_OVR_Pos)) /* Assigment of value for C_OVR in the ISI_SR register */
#define ISI_SR_CRC_ERR_Pos                    _UINT32_(26)                                         /* (ISI_SR) CRC Synchronization Error (cleared on read) Position */
#define ISI_SR_CRC_ERR_Msk                    (_UINT32_(0x1) << ISI_SR_CRC_ERR_Pos)                /* (ISI_SR) CRC Synchronization Error (cleared on read) Mask */
#define ISI_SR_CRC_ERR(value)                 (ISI_SR_CRC_ERR_Msk & (_UINT32_(value) << ISI_SR_CRC_ERR_Pos)) /* Assigment of value for CRC_ERR in the ISI_SR register */
#define ISI_SR_FR_OVR_Pos                     _UINT32_(27)                                         /* (ISI_SR) Frame Rate Overrun (cleared on read) Position */
#define ISI_SR_FR_OVR_Msk                     (_UINT32_(0x1) << ISI_SR_FR_OVR_Pos)                 /* (ISI_SR) Frame Rate Overrun (cleared on read) Mask */
#define ISI_SR_FR_OVR(value)                  (ISI_SR_FR_OVR_Msk & (_UINT32_(value) << ISI_SR_FR_OVR_Pos)) /* Assigment of value for FR_OVR in the ISI_SR register */
#define ISI_SR_Msk                            _UINT32_(0x0F0B0507)                                 /* (ISI_SR) Register Mask  */


/* -------- ISI_IER : (ISI Offset: 0x2C) ( /W 32) ISI Interrupt Enable Register -------- */
#define ISI_IER_DIS_DONE_Pos                  _UINT32_(1)                                          /* (ISI_IER) Disable Done Interrupt Enable Position */
#define ISI_IER_DIS_DONE_Msk                  (_UINT32_(0x1) << ISI_IER_DIS_DONE_Pos)              /* (ISI_IER) Disable Done Interrupt Enable Mask */
#define ISI_IER_DIS_DONE(value)               (ISI_IER_DIS_DONE_Msk & (_UINT32_(value) << ISI_IER_DIS_DONE_Pos)) /* Assigment of value for DIS_DONE in the ISI_IER register */
#define ISI_IER_SRST_Pos                      _UINT32_(2)                                          /* (ISI_IER) Software Reset Interrupt Enable Position */
#define ISI_IER_SRST_Msk                      (_UINT32_(0x1) << ISI_IER_SRST_Pos)                  /* (ISI_IER) Software Reset Interrupt Enable Mask */
#define ISI_IER_SRST(value)                   (ISI_IER_SRST_Msk & (_UINT32_(value) << ISI_IER_SRST_Pos)) /* Assigment of value for SRST in the ISI_IER register */
#define ISI_IER_VSYNC_Pos                     _UINT32_(10)                                         /* (ISI_IER) Vertical Synchronization Interrupt Enable Position */
#define ISI_IER_VSYNC_Msk                     (_UINT32_(0x1) << ISI_IER_VSYNC_Pos)                 /* (ISI_IER) Vertical Synchronization Interrupt Enable Mask */
#define ISI_IER_VSYNC(value)                  (ISI_IER_VSYNC_Msk & (_UINT32_(value) << ISI_IER_VSYNC_Pos)) /* Assigment of value for VSYNC in the ISI_IER register */
#define ISI_IER_PXFR_DONE_Pos                 _UINT32_(16)                                         /* (ISI_IER) Preview DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_PXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IER_PXFR_DONE_Pos)             /* (ISI_IER) Preview DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_PXFR_DONE(value)              (ISI_IER_PXFR_DONE_Msk & (_UINT32_(value) << ISI_IER_PXFR_DONE_Pos)) /* Assigment of value for PXFR_DONE in the ISI_IER register */
#define ISI_IER_CXFR_DONE_Pos                 _UINT32_(17)                                         /* (ISI_IER) Codec DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_CXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IER_CXFR_DONE_Pos)             /* (ISI_IER) Codec DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_CXFR_DONE(value)              (ISI_IER_CXFR_DONE_Msk & (_UINT32_(value) << ISI_IER_CXFR_DONE_Pos)) /* Assigment of value for CXFR_DONE in the ISI_IER register */
#define ISI_IER_P_OVR_Pos                     _UINT32_(24)                                         /* (ISI_IER) Preview Datapath Overflow Interrupt Enable Position */
#define ISI_IER_P_OVR_Msk                     (_UINT32_(0x1) << ISI_IER_P_OVR_Pos)                 /* (ISI_IER) Preview Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_P_OVR(value)                  (ISI_IER_P_OVR_Msk & (_UINT32_(value) << ISI_IER_P_OVR_Pos)) /* Assigment of value for P_OVR in the ISI_IER register */
#define ISI_IER_C_OVR_Pos                     _UINT32_(25)                                         /* (ISI_IER) Codec Datapath Overflow Interrupt Enable Position */
#define ISI_IER_C_OVR_Msk                     (_UINT32_(0x1) << ISI_IER_C_OVR_Pos)                 /* (ISI_IER) Codec Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_C_OVR(value)                  (ISI_IER_C_OVR_Msk & (_UINT32_(value) << ISI_IER_C_OVR_Pos)) /* Assigment of value for C_OVR in the ISI_IER register */
#define ISI_IER_CRC_ERR_Pos                   _UINT32_(26)                                         /* (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Position */
#define ISI_IER_CRC_ERR_Msk                   (_UINT32_(0x1) << ISI_IER_CRC_ERR_Pos)               /* (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Mask */
#define ISI_IER_CRC_ERR(value)                (ISI_IER_CRC_ERR_Msk & (_UINT32_(value) << ISI_IER_CRC_ERR_Pos)) /* Assigment of value for CRC_ERR in the ISI_IER register */
#define ISI_IER_FR_OVR_Pos                    _UINT32_(27)                                         /* (ISI_IER) Frame Rate Overflow Interrupt Enable Position */
#define ISI_IER_FR_OVR_Msk                    (_UINT32_(0x1) << ISI_IER_FR_OVR_Pos)                /* (ISI_IER) Frame Rate Overflow Interrupt Enable Mask */
#define ISI_IER_FR_OVR(value)                 (ISI_IER_FR_OVR_Msk & (_UINT32_(value) << ISI_IER_FR_OVR_Pos)) /* Assigment of value for FR_OVR in the ISI_IER register */
#define ISI_IER_Msk                           _UINT32_(0x0F030406)                                 /* (ISI_IER) Register Mask  */


/* -------- ISI_IDR : (ISI Offset: 0x30) ( /W 32) ISI Interrupt Disable Register -------- */
#define ISI_IDR_DIS_DONE_Pos                  _UINT32_(1)                                          /* (ISI_IDR) Disable Done Interrupt Disable Position */
#define ISI_IDR_DIS_DONE_Msk                  (_UINT32_(0x1) << ISI_IDR_DIS_DONE_Pos)              /* (ISI_IDR) Disable Done Interrupt Disable Mask */
#define ISI_IDR_DIS_DONE(value)               (ISI_IDR_DIS_DONE_Msk & (_UINT32_(value) << ISI_IDR_DIS_DONE_Pos)) /* Assigment of value for DIS_DONE in the ISI_IDR register */
#define ISI_IDR_SRST_Pos                      _UINT32_(2)                                          /* (ISI_IDR) Software Reset Interrupt Disable Position */
#define ISI_IDR_SRST_Msk                      (_UINT32_(0x1) << ISI_IDR_SRST_Pos)                  /* (ISI_IDR) Software Reset Interrupt Disable Mask */
#define ISI_IDR_SRST(value)                   (ISI_IDR_SRST_Msk & (_UINT32_(value) << ISI_IDR_SRST_Pos)) /* Assigment of value for SRST in the ISI_IDR register */
#define ISI_IDR_VSYNC_Pos                     _UINT32_(10)                                         /* (ISI_IDR) Vertical Synchronization Interrupt Disable Position */
#define ISI_IDR_VSYNC_Msk                     (_UINT32_(0x1) << ISI_IDR_VSYNC_Pos)                 /* (ISI_IDR) Vertical Synchronization Interrupt Disable Mask */
#define ISI_IDR_VSYNC(value)                  (ISI_IDR_VSYNC_Msk & (_UINT32_(value) << ISI_IDR_VSYNC_Pos)) /* Assigment of value for VSYNC in the ISI_IDR register */
#define ISI_IDR_PXFR_DONE_Pos                 _UINT32_(16)                                         /* (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_PXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IDR_PXFR_DONE_Pos)             /* (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_PXFR_DONE(value)              (ISI_IDR_PXFR_DONE_Msk & (_UINT32_(value) << ISI_IDR_PXFR_DONE_Pos)) /* Assigment of value for PXFR_DONE in the ISI_IDR register */
#define ISI_IDR_CXFR_DONE_Pos                 _UINT32_(17)                                         /* (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_CXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IDR_CXFR_DONE_Pos)             /* (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_CXFR_DONE(value)              (ISI_IDR_CXFR_DONE_Msk & (_UINT32_(value) << ISI_IDR_CXFR_DONE_Pos)) /* Assigment of value for CXFR_DONE in the ISI_IDR register */
#define ISI_IDR_P_OVR_Pos                     _UINT32_(24)                                         /* (ISI_IDR) Preview Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_P_OVR_Msk                     (_UINT32_(0x1) << ISI_IDR_P_OVR_Pos)                 /* (ISI_IDR) Preview Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_P_OVR(value)                  (ISI_IDR_P_OVR_Msk & (_UINT32_(value) << ISI_IDR_P_OVR_Pos)) /* Assigment of value for P_OVR in the ISI_IDR register */
#define ISI_IDR_C_OVR_Pos                     _UINT32_(25)                                         /* (ISI_IDR) Codec Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_C_OVR_Msk                     (_UINT32_(0x1) << ISI_IDR_C_OVR_Pos)                 /* (ISI_IDR) Codec Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_C_OVR(value)                  (ISI_IDR_C_OVR_Msk & (_UINT32_(value) << ISI_IDR_C_OVR_Pos)) /* Assigment of value for C_OVR in the ISI_IDR register */
#define ISI_IDR_CRC_ERR_Pos                   _UINT32_(26)                                         /* (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Position */
#define ISI_IDR_CRC_ERR_Msk                   (_UINT32_(0x1) << ISI_IDR_CRC_ERR_Pos)               /* (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Mask */
#define ISI_IDR_CRC_ERR(value)                (ISI_IDR_CRC_ERR_Msk & (_UINT32_(value) << ISI_IDR_CRC_ERR_Pos)) /* Assigment of value for CRC_ERR in the ISI_IDR register */
#define ISI_IDR_FR_OVR_Pos                    _UINT32_(27)                                         /* (ISI_IDR) Frame Rate Overflow Interrupt Disable Position */
#define ISI_IDR_FR_OVR_Msk                    (_UINT32_(0x1) << ISI_IDR_FR_OVR_Pos)                /* (ISI_IDR) Frame Rate Overflow Interrupt Disable Mask */
#define ISI_IDR_FR_OVR(value)                 (ISI_IDR_FR_OVR_Msk & (_UINT32_(value) << ISI_IDR_FR_OVR_Pos)) /* Assigment of value for FR_OVR in the ISI_IDR register */
#define ISI_IDR_Msk                           _UINT32_(0x0F030406)                                 /* (ISI_IDR) Register Mask  */


/* -------- ISI_IMR : (ISI Offset: 0x34) ( R/ 32) ISI Interrupt Mask Register -------- */
#define ISI_IMR_DIS_DONE_Pos                  _UINT32_(1)                                          /* (ISI_IMR) Module Disable Operation Completed Position */
#define ISI_IMR_DIS_DONE_Msk                  (_UINT32_(0x1) << ISI_IMR_DIS_DONE_Pos)              /* (ISI_IMR) Module Disable Operation Completed Mask */
#define ISI_IMR_DIS_DONE(value)               (ISI_IMR_DIS_DONE_Msk & (_UINT32_(value) << ISI_IMR_DIS_DONE_Pos)) /* Assigment of value for DIS_DONE in the ISI_IMR register */
#define ISI_IMR_SRST_Pos                      _UINT32_(2)                                          /* (ISI_IMR) Software Reset Completed Position */
#define ISI_IMR_SRST_Msk                      (_UINT32_(0x1) << ISI_IMR_SRST_Pos)                  /* (ISI_IMR) Software Reset Completed Mask */
#define ISI_IMR_SRST(value)                   (ISI_IMR_SRST_Msk & (_UINT32_(value) << ISI_IMR_SRST_Pos)) /* Assigment of value for SRST in the ISI_IMR register */
#define ISI_IMR_VSYNC_Pos                     _UINT32_(10)                                         /* (ISI_IMR) Vertical Synchronization Position */
#define ISI_IMR_VSYNC_Msk                     (_UINT32_(0x1) << ISI_IMR_VSYNC_Pos)                 /* (ISI_IMR) Vertical Synchronization Mask */
#define ISI_IMR_VSYNC(value)                  (ISI_IMR_VSYNC_Msk & (_UINT32_(value) << ISI_IMR_VSYNC_Pos)) /* Assigment of value for VSYNC in the ISI_IMR register */
#define ISI_IMR_PXFR_DONE_Pos                 _UINT32_(16)                                         /* (ISI_IMR) Preview DMA Transfer Completed Position */
#define ISI_IMR_PXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IMR_PXFR_DONE_Pos)             /* (ISI_IMR) Preview DMA Transfer Completed Mask */
#define ISI_IMR_PXFR_DONE(value)              (ISI_IMR_PXFR_DONE_Msk & (_UINT32_(value) << ISI_IMR_PXFR_DONE_Pos)) /* Assigment of value for PXFR_DONE in the ISI_IMR register */
#define ISI_IMR_CXFR_DONE_Pos                 _UINT32_(17)                                         /* (ISI_IMR) Codec DMA Transfer Completed Position */
#define ISI_IMR_CXFR_DONE_Msk                 (_UINT32_(0x1) << ISI_IMR_CXFR_DONE_Pos)             /* (ISI_IMR) Codec DMA Transfer Completed Mask */
#define ISI_IMR_CXFR_DONE(value)              (ISI_IMR_CXFR_DONE_Msk & (_UINT32_(value) << ISI_IMR_CXFR_DONE_Pos)) /* Assigment of value for CXFR_DONE in the ISI_IMR register */
#define ISI_IMR_P_OVR_Pos                     _UINT32_(24)                                         /* (ISI_IMR) Preview FIFO Overflow Position */
#define ISI_IMR_P_OVR_Msk                     (_UINT32_(0x1) << ISI_IMR_P_OVR_Pos)                 /* (ISI_IMR) Preview FIFO Overflow Mask */
#define ISI_IMR_P_OVR(value)                  (ISI_IMR_P_OVR_Msk & (_UINT32_(value) << ISI_IMR_P_OVR_Pos)) /* Assigment of value for P_OVR in the ISI_IMR register */
#define ISI_IMR_C_OVR_Pos                     _UINT32_(25)                                         /* (ISI_IMR) Codec FIFO Overflow Position */
#define ISI_IMR_C_OVR_Msk                     (_UINT32_(0x1) << ISI_IMR_C_OVR_Pos)                 /* (ISI_IMR) Codec FIFO Overflow Mask */
#define ISI_IMR_C_OVR(value)                  (ISI_IMR_C_OVR_Msk & (_UINT32_(value) << ISI_IMR_C_OVR_Pos)) /* Assigment of value for C_OVR in the ISI_IMR register */
#define ISI_IMR_CRC_ERR_Pos                   _UINT32_(26)                                         /* (ISI_IMR) CRC Synchronization Error Position */
#define ISI_IMR_CRC_ERR_Msk                   (_UINT32_(0x1) << ISI_IMR_CRC_ERR_Pos)               /* (ISI_IMR) CRC Synchronization Error Mask */
#define ISI_IMR_CRC_ERR(value)                (ISI_IMR_CRC_ERR_Msk & (_UINT32_(value) << ISI_IMR_CRC_ERR_Pos)) /* Assigment of value for CRC_ERR in the ISI_IMR register */
#define ISI_IMR_FR_OVR_Pos                    _UINT32_(27)                                         /* (ISI_IMR) Frame Rate Overrun Position */
#define ISI_IMR_FR_OVR_Msk                    (_UINT32_(0x1) << ISI_IMR_FR_OVR_Pos)                /* (ISI_IMR) Frame Rate Overrun Mask */
#define ISI_IMR_FR_OVR(value)                 (ISI_IMR_FR_OVR_Msk & (_UINT32_(value) << ISI_IMR_FR_OVR_Pos)) /* Assigment of value for FR_OVR in the ISI_IMR register */
#define ISI_IMR_Msk                           _UINT32_(0x0F030406)                                 /* (ISI_IMR) Register Mask  */


/* -------- ISI_DMA_CHER : (ISI Offset: 0x38) ( /W 32) DMA Channel Enable Register -------- */
#define ISI_DMA_CHER_P_CH_EN_Pos              _UINT32_(0)                                          /* (ISI_DMA_CHER) Preview Channel Enable Position */
#define ISI_DMA_CHER_P_CH_EN_Msk              (_UINT32_(0x1) << ISI_DMA_CHER_P_CH_EN_Pos)          /* (ISI_DMA_CHER) Preview Channel Enable Mask */
#define ISI_DMA_CHER_P_CH_EN(value)           (ISI_DMA_CHER_P_CH_EN_Msk & (_UINT32_(value) << ISI_DMA_CHER_P_CH_EN_Pos)) /* Assigment of value for P_CH_EN in the ISI_DMA_CHER register */
#define ISI_DMA_CHER_C_CH_EN_Pos              _UINT32_(1)                                          /* (ISI_DMA_CHER) Codec Channel Enable Position */
#define ISI_DMA_CHER_C_CH_EN_Msk              (_UINT32_(0x1) << ISI_DMA_CHER_C_CH_EN_Pos)          /* (ISI_DMA_CHER) Codec Channel Enable Mask */
#define ISI_DMA_CHER_C_CH_EN(value)           (ISI_DMA_CHER_C_CH_EN_Msk & (_UINT32_(value) << ISI_DMA_CHER_C_CH_EN_Pos)) /* Assigment of value for C_CH_EN in the ISI_DMA_CHER register */
#define ISI_DMA_CHER_Msk                      _UINT32_(0x00000003)                                 /* (ISI_DMA_CHER) Register Mask  */


/* -------- ISI_DMA_CHDR : (ISI Offset: 0x3C) ( /W 32) DMA Channel Disable Register -------- */
#define ISI_DMA_CHDR_P_CH_DIS_Pos             _UINT32_(0)                                          /* (ISI_DMA_CHDR) Preview Channel Disable Request Position */
#define ISI_DMA_CHDR_P_CH_DIS_Msk             (_UINT32_(0x1) << ISI_DMA_CHDR_P_CH_DIS_Pos)         /* (ISI_DMA_CHDR) Preview Channel Disable Request Mask */
#define ISI_DMA_CHDR_P_CH_DIS(value)          (ISI_DMA_CHDR_P_CH_DIS_Msk & (_UINT32_(value) << ISI_DMA_CHDR_P_CH_DIS_Pos)) /* Assigment of value for P_CH_DIS in the ISI_DMA_CHDR register */
#define ISI_DMA_CHDR_C_CH_DIS_Pos             _UINT32_(1)                                          /* (ISI_DMA_CHDR) Codec Channel Disable Request Position */
#define ISI_DMA_CHDR_C_CH_DIS_Msk             (_UINT32_(0x1) << ISI_DMA_CHDR_C_CH_DIS_Pos)         /* (ISI_DMA_CHDR) Codec Channel Disable Request Mask */
#define ISI_DMA_CHDR_C_CH_DIS(value)          (ISI_DMA_CHDR_C_CH_DIS_Msk & (_UINT32_(value) << ISI_DMA_CHDR_C_CH_DIS_Pos)) /* Assigment of value for C_CH_DIS in the ISI_DMA_CHDR register */
#define ISI_DMA_CHDR_Msk                      _UINT32_(0x00000003)                                 /* (ISI_DMA_CHDR) Register Mask  */


/* -------- ISI_DMA_CHSR : (ISI Offset: 0x40) ( R/ 32) DMA Channel Status Register -------- */
#define ISI_DMA_CHSR_P_CH_S_Pos               _UINT32_(0)                                          /* (ISI_DMA_CHSR) Preview DMA Channel Status Position */
#define ISI_DMA_CHSR_P_CH_S_Msk               (_UINT32_(0x1) << ISI_DMA_CHSR_P_CH_S_Pos)           /* (ISI_DMA_CHSR) Preview DMA Channel Status Mask */
#define ISI_DMA_CHSR_P_CH_S(value)            (ISI_DMA_CHSR_P_CH_S_Msk & (_UINT32_(value) << ISI_DMA_CHSR_P_CH_S_Pos)) /* Assigment of value for P_CH_S in the ISI_DMA_CHSR register */
#define ISI_DMA_CHSR_C_CH_S_Pos               _UINT32_(1)                                          /* (ISI_DMA_CHSR) Code DMA Channel Status Position */
#define ISI_DMA_CHSR_C_CH_S_Msk               (_UINT32_(0x1) << ISI_DMA_CHSR_C_CH_S_Pos)           /* (ISI_DMA_CHSR) Code DMA Channel Status Mask */
#define ISI_DMA_CHSR_C_CH_S(value)            (ISI_DMA_CHSR_C_CH_S_Msk & (_UINT32_(value) << ISI_DMA_CHSR_C_CH_S_Pos)) /* Assigment of value for C_CH_S in the ISI_DMA_CHSR register */
#define ISI_DMA_CHSR_Msk                      _UINT32_(0x00000003)                                 /* (ISI_DMA_CHSR) Register Mask  */


