Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/isi.h
/* -------- ISI_DMA_P_ADDR : (ISI Offset: 0x44) (R/W 32) DMA Preview Base Address Register -------- */
#define ISI_DMA_P_ADDR_P_ADDR_Pos             _UINT32_(2)                                          /* (ISI_DMA_P_ADDR) Preview Image Base Address Position */
#define ISI_DMA_P_ADDR_P_ADDR_Msk             (_UINT32_(0x3FFFFFFF) << ISI_DMA_P_ADDR_P_ADDR_Pos)  /* (ISI_DMA_P_ADDR) Preview Image Base Address Mask */
#define ISI_DMA_P_ADDR_P_ADDR(value)          (ISI_DMA_P_ADDR_P_ADDR_Msk & (_UINT32_(value) << ISI_DMA_P_ADDR_P_ADDR_Pos)) /* Assigment of value for P_ADDR in the ISI_DMA_P_ADDR register */
#define ISI_DMA_P_ADDR_Msk                    _UINT32_(0xFFFFFFFC)                                 /* (ISI_DMA_P_ADDR) Register Mask  */


/* -------- ISI_DMA_P_CTRL : (ISI Offset: 0x48) (R/W 32) DMA Preview Control Register -------- */
#define ISI_DMA_P_CTRL_P_FETCH_Pos            _UINT32_(0)                                          /* (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Position */
#define ISI_DMA_P_CTRL_P_FETCH_Msk            (_UINT32_(0x1) << ISI_DMA_P_CTRL_P_FETCH_Pos)        /* (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Mask */
#define ISI_DMA_P_CTRL_P_FETCH(value)         (ISI_DMA_P_CTRL_P_FETCH_Msk & (_UINT32_(value) << ISI_DMA_P_CTRL_P_FETCH_Pos)) /* Assigment of value for P_FETCH in the ISI_DMA_P_CTRL register */
#define ISI_DMA_P_CTRL_P_WB_Pos               _UINT32_(1)                                          /* (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Position */
#define ISI_DMA_P_CTRL_P_WB_Msk               (_UINT32_(0x1) << ISI_DMA_P_CTRL_P_WB_Pos)           /* (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Mask */
#define ISI_DMA_P_CTRL_P_WB(value)            (ISI_DMA_P_CTRL_P_WB_Msk & (_UINT32_(value) << ISI_DMA_P_CTRL_P_WB_Pos)) /* Assigment of value for P_WB in the ISI_DMA_P_CTRL register */
#define ISI_DMA_P_CTRL_P_IEN_Pos              _UINT32_(2)                                          /* (ISI_DMA_P_CTRL) Transfer Done Flag Control Position */
#define ISI_DMA_P_CTRL_P_IEN_Msk              (_UINT32_(0x1) << ISI_DMA_P_CTRL_P_IEN_Pos)          /* (ISI_DMA_P_CTRL) Transfer Done Flag Control Mask */
#define ISI_DMA_P_CTRL_P_IEN(value)           (ISI_DMA_P_CTRL_P_IEN_Msk & (_UINT32_(value) << ISI_DMA_P_CTRL_P_IEN_Pos)) /* Assigment of value for P_IEN in the ISI_DMA_P_CTRL register */
#define ISI_DMA_P_CTRL_P_DONE_Pos             _UINT32_(3)                                          /* (ISI_DMA_P_CTRL) Preview Transfer Done Position */
#define ISI_DMA_P_CTRL_P_DONE_Msk             (_UINT32_(0x1) << ISI_DMA_P_CTRL_P_DONE_Pos)         /* (ISI_DMA_P_CTRL) Preview Transfer Done Mask */
#define ISI_DMA_P_CTRL_P_DONE(value)          (ISI_DMA_P_CTRL_P_DONE_Msk & (_UINT32_(value) << ISI_DMA_P_CTRL_P_DONE_Pos)) /* Assigment of value for P_DONE in the ISI_DMA_P_CTRL register */
#define ISI_DMA_P_CTRL_Msk                    _UINT32_(0x0000000F)                                 /* (ISI_DMA_P_CTRL) Register Mask  */


/* -------- ISI_DMA_P_DSCR : (ISI Offset: 0x4C) (R/W 32) DMA Preview Descriptor Address Register -------- */
#define ISI_DMA_P_DSCR_P_DSCR_Pos             _UINT32_(2)                                          /* (ISI_DMA_P_DSCR) Preview Descriptor Base Address Position */
#define ISI_DMA_P_DSCR_P_DSCR_Msk             (_UINT32_(0x3FFFFFFF) << ISI_DMA_P_DSCR_P_DSCR_Pos)  /* (ISI_DMA_P_DSCR) Preview Descriptor Base Address Mask */
#define ISI_DMA_P_DSCR_P_DSCR(value)          (ISI_DMA_P_DSCR_P_DSCR_Msk & (_UINT32_(value) << ISI_DMA_P_DSCR_P_DSCR_Pos)) /* Assigment of value for P_DSCR in the ISI_DMA_P_DSCR register */
#define ISI_DMA_P_DSCR_Msk                    _UINT32_(0xFFFFFFFC)                                 /* (ISI_DMA_P_DSCR) Register Mask  */


/* -------- ISI_DMA_C_ADDR : (ISI Offset: 0x50) (R/W 32) DMA Codec Base Address Register -------- */
#define ISI_DMA_C_ADDR_C_ADDR_Pos             _UINT32_(2)                                          /* (ISI_DMA_C_ADDR) Codec Image Base Address Position */
#define ISI_DMA_C_ADDR_C_ADDR_Msk             (_UINT32_(0x3FFFFFFF) << ISI_DMA_C_ADDR_C_ADDR_Pos)  /* (ISI_DMA_C_ADDR) Codec Image Base Address Mask */
#define ISI_DMA_C_ADDR_C_ADDR(value)          (ISI_DMA_C_ADDR_C_ADDR_Msk & (_UINT32_(value) << ISI_DMA_C_ADDR_C_ADDR_Pos)) /* Assigment of value for C_ADDR in the ISI_DMA_C_ADDR register */
#define ISI_DMA_C_ADDR_Msk                    _UINT32_(0xFFFFFFFC)                                 /* (ISI_DMA_C_ADDR) Register Mask  */


/* -------- ISI_DMA_C_CTRL : (ISI Offset: 0x54) (R/W 32) DMA Codec Control Register -------- */
#define ISI_DMA_C_CTRL_C_FETCH_Pos            _UINT32_(0)                                          /* (ISI_DMA_C_CTRL) Descriptor Fetch Control Bit Position */
#define ISI_DMA_C_CTRL_C_FETCH_Msk            (_UINT32_(0x1) << ISI_DMA_C_CTRL_C_FETCH_Pos)        /* (ISI_DMA_C_CTRL) Descriptor Fetch Control Bit Mask */
#define ISI_DMA_C_CTRL_C_FETCH(value)         (ISI_DMA_C_CTRL_C_FETCH_Msk & (_UINT32_(value) << ISI_DMA_C_CTRL_C_FETCH_Pos)) /* Assigment of value for C_FETCH in the ISI_DMA_C_CTRL register */
#define ISI_DMA_C_CTRL_C_WB_Pos               _UINT32_(1)                                          /* (ISI_DMA_C_CTRL) Descriptor Writeback Control Bit Position */
#define ISI_DMA_C_CTRL_C_WB_Msk               (_UINT32_(0x1) << ISI_DMA_C_CTRL_C_WB_Pos)           /* (ISI_DMA_C_CTRL) Descriptor Writeback Control Bit Mask */
#define ISI_DMA_C_CTRL_C_WB(value)            (ISI_DMA_C_CTRL_C_WB_Msk & (_UINT32_(value) << ISI_DMA_C_CTRL_C_WB_Pos)) /* Assigment of value for C_WB in the ISI_DMA_C_CTRL register */
#define ISI_DMA_C_CTRL_C_IEN_Pos              _UINT32_(2)                                          /* (ISI_DMA_C_CTRL) Transfer Done Flag Control Position */
#define ISI_DMA_C_CTRL_C_IEN_Msk              (_UINT32_(0x1) << ISI_DMA_C_CTRL_C_IEN_Pos)          /* (ISI_DMA_C_CTRL) Transfer Done Flag Control Mask */
#define ISI_DMA_C_CTRL_C_IEN(value)           (ISI_DMA_C_CTRL_C_IEN_Msk & (_UINT32_(value) << ISI_DMA_C_CTRL_C_IEN_Pos)) /* Assigment of value for C_IEN in the ISI_DMA_C_CTRL register */
#define ISI_DMA_C_CTRL_C_DONE_Pos             _UINT32_(3)                                          /* (ISI_DMA_C_CTRL) Codec Transfer Done Position */
#define ISI_DMA_C_CTRL_C_DONE_Msk             (_UINT32_(0x1) << ISI_DMA_C_CTRL_C_DONE_Pos)         /* (ISI_DMA_C_CTRL) Codec Transfer Done Mask */
#define ISI_DMA_C_CTRL_C_DONE(value)          (ISI_DMA_C_CTRL_C_DONE_Msk & (_UINT32_(value) << ISI_DMA_C_CTRL_C_DONE_Pos)) /* Assigment of value for C_DONE in the ISI_DMA_C_CTRL register */
#define ISI_DMA_C_CTRL_Msk                    _UINT32_(0x0000000F)                                 /* (ISI_DMA_C_CTRL) Register Mask  */


