Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/isi.h
/* -------- ISI_DMA_C_DSCR : (ISI Offset: 0x58) (R/W 32) DMA Codec Descriptor Address Register -------- */
#define ISI_DMA_C_DSCR_C_DSCR_Pos             _UINT32_(2)                                          /* (ISI_DMA_C_DSCR) Codec Descriptor Base Address Position */
#define ISI_DMA_C_DSCR_C_DSCR_Msk             (_UINT32_(0x3FFFFFFF) << ISI_DMA_C_DSCR_C_DSCR_Pos)  /* (ISI_DMA_C_DSCR) Codec Descriptor Base Address Mask */
#define ISI_DMA_C_DSCR_C_DSCR(value)          (ISI_DMA_C_DSCR_C_DSCR_Msk & (_UINT32_(value) << ISI_DMA_C_DSCR_C_DSCR_Pos)) /* Assigment of value for C_DSCR in the ISI_DMA_C_DSCR register */
#define ISI_DMA_C_DSCR_Msk                    _UINT32_(0xFFFFFFFC)                                 /* (ISI_DMA_C_DSCR) Register Mask  */


/* -------- ISI_WPMR : (ISI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define ISI_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (ISI_WPMR) Write Protection Enable Position */
#define ISI_WPMR_WPEN_Msk                     (_UINT32_(0x1) << ISI_WPMR_WPEN_Pos)                 /* (ISI_WPMR) Write Protection Enable Mask */
#define ISI_WPMR_WPEN(value)                  (ISI_WPMR_WPEN_Msk & (_UINT32_(value) << ISI_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the ISI_WPMR register */
#define ISI_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (ISI_WPMR) Write Protection Key Password Position */
#define ISI_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << ISI_WPMR_WPKEY_Pos)           /* (ISI_WPMR) Write Protection Key Password Mask */
#define ISI_WPMR_WPKEY(value)                 (ISI_WPMR_WPKEY_Msk & (_UINT32_(value) << ISI_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the ISI_WPMR register */
#define   ISI_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x495349)                                   /* (ISI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define ISI_WPMR_WPKEY_PASSWD                 (ISI_WPMR_WPKEY_PASSWD_Val << ISI_WPMR_WPKEY_Pos)    /* (ISI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define ISI_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (ISI_WPMR) Register Mask  */


/* -------- ISI_WPSR : (ISI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define ISI_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (ISI_WPSR) Write Protection Violation Status Position */
#define ISI_WPSR_WPVS_Msk                     (_UINT32_(0x1) << ISI_WPSR_WPVS_Pos)                 /* (ISI_WPSR) Write Protection Violation Status Mask */
#define ISI_WPSR_WPVS(value)                  (ISI_WPSR_WPVS_Msk & (_UINT32_(value) << ISI_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the ISI_WPSR register */
#define ISI_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (ISI_WPSR) Write Protection Violation Source Position */
#define ISI_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << ISI_WPSR_WPVSRC_Pos)            /* (ISI_WPSR) Write Protection Violation Source Mask */
#define ISI_WPSR_WPVSRC(value)                (ISI_WPSR_WPVSRC_Msk & (_UINT32_(value) << ISI_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the ISI_WPSR register */
#define ISI_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (ISI_WPSR) Register Mask  */


/** \brief ISI register offsets definitions */
#define ISI_CFG1_REG_OFST              _UINT32_(0x00)      /* (ISI_CFG1) ISI Configuration 1 Register Offset */
#define ISI_CFG2_REG_OFST              _UINT32_(0x04)      /* (ISI_CFG2) ISI Configuration 2 Register Offset */
#define ISI_PSIZE_REG_OFST             _UINT32_(0x08)      /* (ISI_PSIZE) ISI Preview Size Register Offset */
#define ISI_PDECF_REG_OFST             _UINT32_(0x0C)      /* (ISI_PDECF) ISI Preview Decimation Factor Register Offset */
#define ISI_Y2R_SET0_REG_OFST          _UINT32_(0x10)      /* (ISI_Y2R_SET0) ISI Color Space Conversion YCrCb To RGB Set 0 Register Offset */
#define ISI_Y2R_SET1_REG_OFST          _UINT32_(0x14)      /* (ISI_Y2R_SET1) ISI Color Space Conversion YCrCb To RGB Set 1 Register Offset */
#define ISI_R2Y_SET0_REG_OFST          _UINT32_(0x18)      /* (ISI_R2Y_SET0) ISI Color Space Conversion RGB To YCrCb Set 0 Register Offset */
#define ISI_R2Y_SET1_REG_OFST          _UINT32_(0x1C)      /* (ISI_R2Y_SET1) ISI Color Space Conversion RGB To YCrCb Set 1 Register Offset */
#define ISI_R2Y_SET2_REG_OFST          _UINT32_(0x20)      /* (ISI_R2Y_SET2) ISI Color Space Conversion RGB To YCrCb Set 2 Register Offset */
#define ISI_CR_REG_OFST                _UINT32_(0x24)      /* (ISI_CR) ISI Control Register Offset */
#define ISI_SR_REG_OFST                _UINT32_(0x28)      /* (ISI_SR) ISI Status Register Offset */
#define ISI_IER_REG_OFST               _UINT32_(0x2C)      /* (ISI_IER) ISI Interrupt Enable Register Offset */
#define ISI_IDR_REG_OFST               _UINT32_(0x30)      /* (ISI_IDR) ISI Interrupt Disable Register Offset */
#define ISI_IMR_REG_OFST               _UINT32_(0x34)      /* (ISI_IMR) ISI Interrupt Mask Register Offset */
#define ISI_DMA_CHER_REG_OFST          _UINT32_(0x38)      /* (ISI_DMA_CHER) DMA Channel Enable Register Offset */
#define ISI_DMA_CHDR_REG_OFST          _UINT32_(0x3C)      /* (ISI_DMA_CHDR) DMA Channel Disable Register Offset */
#define ISI_DMA_CHSR_REG_OFST          _UINT32_(0x40)      /* (ISI_DMA_CHSR) DMA Channel Status Register Offset */
#define ISI_DMA_P_ADDR_REG_OFST        _UINT32_(0x44)      /* (ISI_DMA_P_ADDR) DMA Preview Base Address Register Offset */
#define ISI_DMA_P_CTRL_REG_OFST        _UINT32_(0x48)      /* (ISI_DMA_P_CTRL) DMA Preview Control Register Offset */
#define ISI_DMA_P_DSCR_REG_OFST        _UINT32_(0x4C)      /* (ISI_DMA_P_DSCR) DMA Preview Descriptor Address Register Offset */
#define ISI_DMA_C_ADDR_REG_OFST        _UINT32_(0x50)      /* (ISI_DMA_C_ADDR) DMA Codec Base Address Register Offset */
#define ISI_DMA_C_CTRL_REG_OFST        _UINT32_(0x54)      /* (ISI_DMA_C_CTRL) DMA Codec Control Register Offset */
#define ISI_DMA_C_DSCR_REG_OFST        _UINT32_(0x58)      /* (ISI_DMA_C_DSCR) DMA Codec Descriptor Address Register Offset */
#define ISI_WPMR_REG_OFST              _UINT32_(0xE4)      /* (ISI_WPMR) Write Protection Mode Register Offset */
#define ISI_WPSR_REG_OFST              _UINT32_(0xE8)      /* (ISI_WPSR) Write Protection Status Register Offset */

